Defklol/CNBBM/nRF5-SDK-for-Mesh-master/examples/Clustering_Network/node_2A/src/main.c
    if(level < compare_level)
    {
        if(input == 1)
        {
          self_node_attr.destination_addr = src;
          compare_level = level;
        }else
        {
          self_node_attr.destination_addr = src;
          compare_level = level;
        }
    }
}


/******************************************************************************/
/*                          Beacon Broadcast/Scanning Callback                */
/******************************************************************************/
static void rx_cb(const nrf_mesh_adv_packet_rx_data_t *p_rx_data)
{
    //char msg[65];

    bool node_check_flag = 0;
    static uint8_t BS_ch_adv_level_compare = 255;
    static uint8_t relay_tid = 0;
    uint32_t addr = 0, max_addr, self_addr;
    uint8_t adv_packet_status;

    adv_packet_status = self_node_attr.adv_status;
/*
    (void)snprintf(msg, sizeof(msg),"RX [@%u]: RSSI: %3d ADV TYPE: %x ADDR: [%02x:%02x:%02x:%02x:%02x:%02x]",
                          p_rx_data->p_metadata->params.scanner.timestamp,
                          p_rx_data->p_metadata->params.scanner.rssi,
                          p_rx_data->adv_type,
                          p_rx_data->p_metadata->params.scanner.adv_addr.addr[0],
                          p_rx_data->p_metadata->params.scanner.adv_addr.addr[1],
                          p_rx_data->p_metadata->params.scanner.adv_addr.addr[2],
                          p_rx_data->p_metadata->params.scanner.adv_addr.addr[3],
                          p_rx_data->p_metadata->params.scanner.adv_addr.addr[4],
                          p_rx_data->p_metadata->params.scanner.adv_addr.addr[5]);
*/

    if (provision_flag)
    {
        //Receive EMH ADV,and set emh msg.
        if(p_rx_data->p_payload[9] == 0xe2 && p_rx_data->p_payload[10] == 0x1f && p_rx_data->p_payload[11] == 0xc4 && p_rx_data->p_payload[12] == 0x9b && p_rx_data->p_payload[13] == 0xda &&
            p_rx_data->p_payload[29] == 0x00)
        {            
            //Receive EMH Beacon, Set EMH MSG.
            if(!m_emh_status)
            {
                m_emh_status = true;
                emergency_help_client_set_unreliable(&m_emh_clients[0], GROUP_MSG_REPEAT_COUNT, self_node_attr.self_addr);
            }
        }
        
        /**
        * Receive BS ADV and MNs rebroadcast ADV,using to divide level.
        * DIVIDE_LEVEL_PREFIX : 9/15
        * MAJOR_LOCATE  : 24/2
        * MINOR_LOCATE  : 26/2
        * Level         : 27/1
        * Repeat Tid    : 28/1
        */
        if(p_rx_data->p_payload[9] == 0x88 && p_rx_data->p_payload[10] == 0x1b && p_rx_data->p_payload[11] == 0xa1 && p_rx_data->p_payload[12] == 0xb4 &&
           p_rx_data->p_payload[13] == 0x2e && p_rx_data->p_payload[14] == 0x12 && p_rx_data->p_payload[15] == 0x67 && p_rx_data->p_payload[16] == 0x21 &&
           p_rx_data->p_payload[17] == 0x58 && p_rx_data->p_payload[18] == 0xc8 && p_rx_data->p_payload[19] == 0x57 && p_rx_data->p_payload[20] == 0x6a &&
           p_rx_data->p_payload[21] == 0xab && p_rx_data->p_payload[22] == 0x7a && p_rx_data->p_payload[23] == 0xa9 &&
           adv_packet_status != 2 && adv_packet_status != 3 && adv_packet_status != 4 )
        {            
            //Same Level
            if( MAJOR_LOCATE_H == p_rx_data->p_payload[24] && MAJOR_LOCATE_L == p_rx_data->p_payload[25] &&
                MINOR_LOCATE_H == p_rx_data->p_payload[26] && MINOR_LOCATE_L == p_rx_data->p_payload[27] &&
                p_rx_data->p_payload[29] > relay_tid)
            {
                relay_tid = p_rx_data->p_payload[29];
                BS_relay_adv(BS_ch_adv_level_compare-1, relay_tid);
            }
            //High Level
            if(p_rx_data->p_payload[28] <= BS_ch_adv_level_compare)
            {
                BS_ch_adv_level_compare = p_rx_data->p_payload[28];
                relay_tid = p_rx_data->p_payload[29];
                self_node_attr.ch_flag = 1;

                BS_relay_adv(BS_ch_adv_level_compare, relay_tid);
            }
        }

        /**
        * CH election compare.
        * CH_ADV_PREFIX : 9/4
        * Max_address   : 14/2
        * Max_priority  : 16/1
        * Self_addr     : 17/2
        *
        * MAJOR_LOCATE  : 25/2
        * MINOR_LOCATE  : 27/2
        */
        if(p_rx_data->p_payload[9] == 0x02 && p_rx_data->p_payload[10] == 0x56 && p_rx_data->p_payload[11] == 0xf6 &&
            p_rx_data->p_payload[12] == 0xde && p_rx_data->p_payload[13] == 0xde &&
            MAJOR_LOCATE_H == p_rx_data->p_payload[25] && MAJOR_LOCATE_L == p_rx_data->p_payload[26] &&
            MINOR_LOCATE_H == p_rx_data->p_payload[27] && MINOR_LOCATE_L == p_rx_data->p_payload[28] &&
            adv_packet_status != 3 && adv_packet_status !=4 &&
            (adv_packet_status == 2 || adv_packet_status == 5))
        {
            max_addr  = (p_rx_data->p_payload[14])<<8 | p_rx_data->p_payload[15];
            self_addr = (p_rx_data->p_payload[17])<<8 | p_rx_data->p_payload[18];
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Receive Max_Addr 0x%04x :: 0x%04x Receive_Node_Addr\n", max_addr, self_addr);
            
            if(max_addr != 0x0000) ch_election_priority_compare( max_addr, p_rx_data->p_payload[16], self_addr);

            if(adv_packet_status == 5 ) ch_election_start();
        }

        

        /**
        * Receive CH ADV data,Useing for exchange CH and MNs destination address.
        * I_AM_CH_PREFIX  : 9/12
        * MAJOR_LOCATE    : 21/2
        * MINOR_LOCATE    : 23/2
        * Self_Addr       : 25/2
        * Level           : 27/1
        */
        if(p_rx_data->p_payload[9] == 0xf8 && p_rx_data->p_payload[10] == 0x44 && p_rx_data->p_payload[11] == 0x7e && p_rx_data->p_payload[12] == 0x27 &&
           p_rx_data->p_payload[13] == 0x70 && p_rx_data->p_payload[14] == 0xcc && p_rx_data->p_payload[15] == 0x64 && p_rx_data->p_payload[16] == 0xd8 &&
           p_rx_data->p_payload[17] == 0x35 && p_rx_data->p_payload[18] == 0xbb && p_rx_data->p_payload[19] == 0x0c && p_rx_data->p_payload[20] == 0xe0 &&
           adv_packet_status != 5)
        {         
            addr = p_rx_data->p_payload[25] << 8 | p_rx_data->p_payload[26];
            //MNs receive CH data.
            if( p_rx_data->p_payload[21] == MAJOR_LOCATE_H && p_rx_data->p_payload[22] == MAJOR_LOCATE_L && 
                p_rx_data->p_payload[23] == MINOR_LOCATE_H && p_rx_data->p_payload[24] == MINOR_LOCATE_L && adv_packet_status != 3)
            {
                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "MNs receive CH data.\n");
                mns_exchange_routing(1, addr, 0);
            }
            //CH receive CH data
            if( p_rx_data->p_payload[21] != MAJOR_LOCATE_H || p_rx_data->p_payload[22] != MAJOR_LOCATE_L || 
                p_rx_data->p_payload[23] != MINOR_LOCATE_H || p_rx_data->p_payload[24] != MINOR_LOCATE_L && adv_packet_status == 3)
            {
                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "CH receive CH data.\n");
                ch_exchange_routing(1, addr, p_rx_data->p_payload[27]);
            }
        }
         
        /**
        * Receive MNs ADV data,Useing for exchange CH and MNs destination address.
        * I_AM_CH_PREFIX  : 9/12
        * MAJOR_LOCATE    : 21/2
        * MINOR_LOCATE    : 23/2
        * Self_Addr       : 25/2
        * Hop             : 27/1
        * Level           : 28/1
        * Destination addr have to Bs flag : 29/1
        */
        if(p_rx_data->p_payload[9] == 0x38 && p_rx_data->p_payload[10] == 0x32 && p_rx_data->p_payload[11] == 0x89 && p_rx_data->p_payload[12] == 0xbf &&
           p_rx_data->p_payload[13] == 0xde && p_rx_data->p_payload[14] == 0xc2 && p_rx_data->p_payload[15] == 0x71 && p_rx_data->p_payload[16] == 0x84 &&
           p_rx_data->p_payload[17] == 0x4a && p_rx_data->p_payload[18] == 0x47 && p_rx_data->p_payload[19] == 0x24 && p_rx_data->p_payload[20] == 0x82 &&
           adv_packet_status != 5)
        {
            addr = p_rx_data->p_payload[25] << 8 | p_rx_data->p_payload[26];
            //MNs receive MNs data.
            if( p_rx_data->p_payload[21] == MAJOR_LOCATE_H && p_rx_data->p_payload[22] == MAJOR_LOCATE_L && 
                p_rx_data->p_payload[23] == MINOR_LOCATE_H && p_rx_data->p_payload[24] == MINOR_LOCATE_L &&
                adv_packet_status == 4)
            {
                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "MNs receive MNs data.\n");
                mns_exchange_routing(1, addr, p_rx_data->p_payload[27]);
            }
            //CH receive MNs data
            if( p_rx_data->p_payload[21] != MAJOR_LOCATE_H || p_rx_data->p_payload[22] != MAJOR_LOCATE_L || 
                p_rx_data->p_payload[23] != MINOR_LOCATE_H || p_rx_data->p_payload[24] != MINOR_LOCATE_L &&
                adv_packet_status == 3)
            {
                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "CH receive MNs data.\n");
                ch_exchange_routing(2, addr, p_rx_data->p_payload[28]);
            }
        }
    }
}

/******************************************************************************/
/*                          Clinet Element Callback                           */
/******************************************************************************/
static void client_publish_timeout_cb(access_model_handle_t handle, void * p_self)
{
     __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "Acknowledged send timedout\n");
}

static void emh_client_status_cb(const emergency_help_client_t *p_self, emergency_help_status_t status, uint16_t src)
{
    switch (status)
    {
        case EMERGENCY_HELP_STATUS_RECEIVE:
            
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, " SRC 0x%04x status RECEIV\n", src);
            
