Defklol/CNBBM/nRF5-SDK-for-Mesh-master/examples/Clustering_Network/node_2A/src/main.c
            m_emh_status = false;
            
            break;

        case EMERGENCY_HELP_STATUS_ERROR_NO_REPLY:
            
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "No reply from  SRC 0x%04x\n", src);

            m_emh_status = false;
            break;

        case EMERGENCY_HELP_STATUS_CANCELLED:

            __LOG(LOG_SRC_APP, LOG_LEVEL_WARN, "Message to SRC 0x%04x cancelled\n", src);

            m_emh_status = false;
            break;

        default:

            __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "Unknown status \n");
            break;
    }
}

/******************************************************************************/
/*                          Server Element Callback                           */
/******************************************************************************/
static void bat_server_set_unreliable_cb(const simple_battery_server_t *p_self, uint8_t bat_value, uint16_t msg_src)
{
    uint32_t status;

    //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Self Node Addr : 0x%04x, BAT Value %d,MSG SRC Node 0%04x\n", self_node_attr.self_addr, bat_value, msg_src);
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Self Node Addr :0x%04x,Receive Addr 0x%04x BAT Value %d\n", self_node_attr.self_addr, msg_src, bat_value);
    status = simple_battery_client_set_unreliable(&m_bat_clients[0], adc_value, GROUP_MSG_REPEAT_COUNT, msg_src);
}

static void emh_server_set_unreliable_cb(const emergency_help_server_t *p_self, uint16_t src)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "EMH UN_MSG SRC : 0x%04x\n",  src);
    emergency_help_client_set_unreliable(&m_emh_clients[0], GROUP_MSG_REPEAT_COUNT, src);

}

static bool emh_server_set_cb(const emergency_help_server_t * p_self, uint16_t en_emh, uint16_t src)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "EMH UN_MSG SRC : 0x%04x\n",  src);
}

/*****************************************************************************************/

static void node_reset(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "----- Node reset  -----\n");
    hal_led_blink_ms(LEDS_MASK, LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_RESET);
    /* This function may return if there are ongoing flash operations. */
    mesh_stack_device_reset();
}

static void config_server_evt_cb(const config_server_evt_t * p_evt)
{
    if (p_evt->type == CONFIG_SERVER_EVT_NODE_RESET)
    {
        node_reset();
    }
}

static void button_event_handler(uint32_t button_number)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Button %u pressed\n", button_number);

    uint32_t status = NRF_SUCCESS;
    static uint8_t device_ID;
    //static bool test_flag = 1;
    static uint16_t node_addr = 0;
    
    
    switch (button_number)
    {
        case 0:
            //status = emergency_help_client_set(&m_emh_clients[0]);
            emergency_help_client_set_unreliable(&m_emh_clients[0], GROUP_MSG_REPEAT_COUNT, node_addr);
                       
            break;

        case 1:
/*
            status = simple_battery_client_set_unreliable(&m_bat_clients[0], adc_value, GROUP_MSG_REPEAT_COUNT, self_node_attr.self_addr);
            if (status == NRF_SUCCESS)
            {
                //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Detect ADC Value %d\n", adc_value);
                hal_led_blink_ms(BSP_LED_0_MASK, LED_BLINK_SHORT_INTERVAL_MS, LED_BLINK_CNT_NO_REPLY);
            }
*/
            break;
            
        case 2:
/*        
            if(!test_flag)
            {
                test_flag = 1;
                set_model_publish_address(0x0102, m_bat_clients[0].model_handle);
            }
*/         
            status = simple_battery_client_set_unreliable(&m_bat_clients[0], adc_value, GROUP_MSG_REPEAT_COUNT, self_node_attr.self_addr);
            if (status == NRF_SUCCESS)
            {
                //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Detect ADC Value %d\n", adc_value);
                hal_led_blink_ms(BSP_LED_0_MASK, LED_BLINK_SHORT_INTERVAL_MS, LED_BLINK_CNT_NO_REPLY);
            }
            break;
            
        case 3:
            mesh_stack_config_clear();
            node_reset();
            break;

        default:
            break;
    }

    switch (status)
    {
        case NRF_SUCCESS:
            break;

        case NRF_ERROR_NO_MEM:
        case NRF_ERROR_BUSY:
        case NRF_ERROR_INVALID_STATE:
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Cannot send - client %u is busy\n", button_number);
            hal_led_blink_ms(LEDS_MASK, LED_BLINK_SHORT_INTERVAL_MS, LED_BLINK_CNT_NO_REPLY);
            break;

        case NRF_ERROR_INVALID_PARAM:
            /* Publication not enabled for this client. One (or more) of the following is wrong:
             * - An application key is missing, or there is no application key bound to the model
             * - The client does not have its publication state set
             *
             * It is the provisioner that adds an application key, binds it to the model and sets
             * the model's publication state.
             */
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Publication not configured for client %u\n", button_number);
            break;

        default:
            ERROR_CHECK(status);
            break;
    }
}

static void rtt_input_handler(int key)
{
    if (key >= '0' && key <= '3')
    {
        uint32_t button_number = key - '0';
        button_event_handler(button_number);
    }
}


//Model Elememt Count : nrf_mesh_config_app.h #define ACCESS_ELEMENT_COUNT (count)
static void models_init_cb(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Initializing and adding models\n");
   
    //Initial Battery  Client Model.
    m_bat_clients[0].timeout_cb = client_publish_timeout_cb;
    ERROR_CHECK(simple_battery_client_init(&m_bat_clients[0], 1));
    ERROR_CHECK(access_model_subscription_list_alloc(m_bat_clients[0].model_handle));
    

    //Initial Battery Server Model.
    m_bat_servers[0].set_unreliable_cb = bat_server_set_unreliable_cb;
    ERROR_CHECK(simple_battery_server_init(&m_bat_servers[0], 2));
    ERROR_CHECK(access_model_subscription_list_alloc(m_bat_servers[0].model_handle));
    

    //Initial Emergency Help Client Model.
    m_emh_clients[0].status_cb = emh_client_status_cb;
    m_emh_clients[0].timeout_cb = client_publish_timeout_cb;
    ERROR_CHECK(emergency_help_client_init(&m_emh_clients[0], 1));
    ERROR_CHECK(access_model_subscription_list_alloc(m_emh_clients[0].model_handle));
    
