Defklol/CNBBM/nRF5-SDK-for-Mesh-master/examples/Clustering_Network/node_2A/src/main.c
//Use for bs devide level.    status : 1.
static void BS_relay_adv(uint8_t rc_level, uint8_t relay_tid)
{
    static bool first_flag = 0;       //First start have run @ch_election_adv().
    static uint8_t first_timer = 0;   //First start, 3min go to ch election. 1 times 10(s)
    
    static bool step_flag=0;
    if(!step_flag)
    {
        step_flag=1;
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Step1. Devide Level.\n");
    }
    
    self_node_attr.adv_status = 1;
    self_node_attr.i_am_ch = 0;
    

    advertiser_enable(&m_advertiser);
    static uint8_t adv_data[] = 
    {
        0x02, 0x01, 0x06,
        0x1a, 0xff, 0x00, 0xff,
        0x02, 0x15,
        0x88, 0x1b, 0xa1, 0xb4,
        0x2e, 0x12, 0x67, 0x21,
        0x58, 0xc8, 0x57, 0x6a,
        0xab, 0x7a, 0xa9,        
        MAJOR_LOCATE_H , MAJOR_LOCATE_L,
        MINOR_LOCATE_H , MINOR_LOCATE_L,
        0x00,                                //Level
        0x00                                //Repeat tid
    };

    
       
    while(adv_data[28] == 0) adv_data[28] = self_node_attr.level = rc_level+1;
    
    adv_data[29] = relay_tid;

    //self_node_attr.level = rc_level+1;

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "\nReceive BS ADV\nMAJOR 0x%02x%02x\nMINOR 0x%02x%02x\nLevel %d\nTid %d\n", adv_data[24], adv_data[25], adv_data[26], adv_data[27], adv_data[28], adv_data[29]);

    adv_packet_t *p_packet = advertiser_packet_alloc(&m_advertiser, sizeof(adv_data));
    if(p_packet){
        memcpy(p_packet->packet.payload, adv_data, sizeof(adv_data));

        p_packet->config.repeats = ADVERTISER_REPEAT_INFINITE;
        advertiser_packet_send(&m_advertiser, p_packet);
    }

    if(!first_flag && first_timer == BS_RELAY_TIMEOUT)
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Step2. Election Clustering Header.\n");
        first_flag = 1;
        first_timer = BS_RELAY_TIMEOUT+1;
        ch_election_start();
    }else first_timer ++;
}

//Use for ch election.        status : 2.
static void ch_election_adv(uint16_t max_addr, uint8_t max_priority)
{
    static uint8_t times = 0;
    self_node_attr.adv_status = 2;

    advertiser_enable(&m_advertiser);
    static uint8_t adv_data[] = 
    {
        0x02, 0x01, 0x06,
        0x1a, 0xff, 0x00, 0x59,
        0x02, 0x15,
        0x02, 0x56, 0xf6, 0xde, 0xde,     //CH_ADV_PREFIX
        0x00, 0x00,                       //max addr.         14.15
        0x00,                             //max priority.     16
        0xff, 0xff,                       //self addr         17.18
        0x00, 0x00,   
        0x00, 0x11, 0x22, 0x33,
        MAJOR_LOCATE_H, MAJOR_LOCATE_L,   
        MINOR_LOCATE_H, MINOR_LOCATE_L,
        0x88
    };
    
    //if no receive other node adv,re broadcast uppon adv.
    if(!max_addr)
    {
        adv_data[14] = (uint8_t)(self_node_attr.self_addr>>8);
        adv_data[15] = (uint8_t)(self_node_attr.self_addr&0xFF);
        adv_data[16] = (adc_value - 153)/10;;
        adv_data[17] = (uint8_t)(self_node_attr.self_addr>>8);
        adv_data[18] = (uint8_t)(self_node_attr.self_addr&0xFF);
    }
    else
    {
        adv_data[14] = (uint8_t)(max_addr>>8);
        adv_data[15] = (uint8_t)(max_addr&0xFF);
        adv_data[16] = max_priority;
        adv_data[17] = (uint8_t)(self_node_attr.self_addr>>8);
        adv_data[18] = (uint8_t)(self_node_attr.self_addr&0xFF);
    }
    
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "\nCH Election ADV\nMAX Addr 0x%02x%02x\nMAX Priority %02d\nSelf Addr 0x%02x%02x\n", adv_data[14], adv_data[15], adv_data[16], adv_data[17], adv_data[18]);

    adv_packet_t *p_packet = advertiser_packet_alloc(&m_advertiser, sizeof(adv_data));
    if(p_packet){
        memcpy(p_packet->packet.payload, adv_data, sizeof(adv_data));

        p_packet->config.repeats = ADVERTISER_REPEAT_INFINITE;

        advertiser_packet_send(&m_advertiser, p_packet);
    }

    if(times == CH_ELECTION_TIMEOUT)
    {   
        times = 0;
        app_timer_stop(m_ch_election_id);

        if(adv_data[17] == adv_data[14] && adv_data[18] == adv_data[15])
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Step3.I am CH\n");
            self_node_attr.i_am_ch = 1;
            
            i_am_ch_start();
        }else __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Step3.I am MNs\n");;
    }

    times++;
}

//CH broadcast adv data.     status 3          
static void i_am_ch_adv(void)
{
    static uint8_t times = 0;
    static uint32_t status = 0;
    
    self_node_attr.adv_status = 3;
    

    advertiser_enable(&m_advertiser);
    static uint8_t adv_data[] = 
    {
        0x02, 0x01, 0x06,
        0x1a, 0xff, 0x00, 0xff,
        0x02, 0x15,
        0xf8, 0x44, 0x7e, 0x27,
        0x70, 0xcc, 0x64, 0xd8,
        0x35, 0xbb, 0x0c, 0xe0,
        MAJOR_LOCATE_H, MAJOR_LOCATE_L,   
        MINOR_LOCATE_H, MINOR_LOCATE_L,
        0x00, 0x00,                 //Self addr
        0x00, 0x00,                 //level
        0x00                        
    };

    adv_data[25] = (uint8_t)(self_node_attr.self_addr>>8);
    adv_data[26] = (uint8_t)(self_node_attr.self_addr&0xFF);
    while(adv_data[27]==0) adv_data[27] = self_node_attr.level;

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "\nI am CH\nSelf Addr 0x%02x%02x\nSelf level %d\n", adv_data[25], adv_data[26], adv_data[27]);

    adv_packet_t *p_packet = advertiser_packet_alloc(&m_advertiser, sizeof(adv_data));
    if(p_packet){
        memcpy(p_packet->packet.payload, adv_data, sizeof(adv_data));

        p_packet->config.repeats = ADVERTISER_REPEAT_INFINITE;

        advertiser_packet_send(&m_advertiser, p_packet);
    }

    if(times == I_AM_CH_TIMEOUT)
    {
        self_node_attr.adv_status = 5;
        app_timer_stop(m_i_am_ch_id);
        times = 0;
        if(self_node_attr.level == 1)
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "\nI AM CH\nSelf Addr 0x%04x publish destination addr 0x0000\n", self_node_attr.self_addr);
            //set publish addr.
            self_node_attr.destination_addr = 0x0000;
            set_model_publish_address(self_node_attr.destination_addr+2, m_bat_clients[0].model_handle);
            set_model_publish_address(self_node_attr.destination_addr+2, m_emh_clients[0].model_handle);
            bat_publish_start();

            status = simple_battery_client_set_unreliable(&m_bat_clients[0], adc_value, 3, self_node_attr.self_addr);
            if(status==NRF_SUCCESS) hal_led_blink_ms(BSP_LED_0_MASK, LED_BLINK_SHORT_INTERVAL_MS, LED_BLINK_CNT_NO_REPLY);
            

